let questions = Array();

questions.push(
	{
		message: "Пройти тест",
		choices: null
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Разрабатывать компьютерные программы и алгоритмы",
				type: 3
			},
			{
				message: "Вести занятия в фитнес-зале",
				type: 1
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Ухаживать за домашними животными",
				type: 2
			},
			{
				message: "Обрабатывать музыкальные композиции",
				type: 5
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Анализировать изменения цен акций на бирже",
				type: 4
			},
			{
				message: "Исследовать поведение животных в искусственных лабораторных условиях",
				type: 2
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Лечить людей или помогать им психологически",
				type: 1
			},
			{
				message: "Ремонтировать и настраивать компьютерную технику",
				type: 3
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Обучать учеников или студентов",
				type: 1
			},
			{
				message: "Изучать микроорганизмы и бактерии с помощью современных микроскопов",
				type: 2
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Проводить предпродажное тестирование смартфонов и компьютерной техники",
				type: 3
			},
			{
				message: "Анализировать экологическое состояние природных водоемов",
				type: 2
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Вести свой блог или писать статьи для различных изданий",
				type: 5
			},
			{
				message: "Проверять правильность заполнения документов, договоров, доверенностей",
				type: 4
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Проверять исправность систем самолета перед вылетом",
				type: 3
			},
			{
				message: "Заниматься оформлением выставок и витрин",
				type: 5
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Заниматься ландшафтным дизайном, архитектурой зданий",
				type: 5
			},
			{
				message: "Переводить фильмы и сериалы на другие языки",
				type: 4
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Подбирать для туристов оптимальные места отдыха, проводить им экскурсии",
				type: 1
			},
			{
				message: "Следить за состоянием лесов, вовремя предпринимать меры по их восстановлению",
				type: 2
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Проводить денежные операции между счетами, вести строгий учет движения денежных средств",
				type: 4
			},
			{
				message: "Создавать новые модели одежды или аксессуаров в соответствии с модой",
				type: 5
			}
		)
	});



questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Редактировать тексты, находя и исправляя в них ошибки",
				type: 4
			},
			{
				message: "Обеспечивать безопасность корпоративной сетевой инфраструктуры",
				type: 3
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Заниматься генной модификацией",
				type: 2
			},
			{
				message: "Находить неисправности в автомобилях, ремонтировать их и выполнять сервисное обслуживание",
				type: 3
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Делать необычные декоративные предметы из дерева, металла, стекла и др. материалов",
				type: 5
			},
			{
				message: "Продавать редкие товары, убеждая клиента купить",
				type: 1
			}
		)
	});

questions.push(
	{
		message: "Что бы вы предпочли?",
		choices: Array(
			{
				message: "Участвовать в пресс-конференциях, представлять интересы компании на переговорах и выставках",
				type: 1
			},
			{
				message: "Обрабатывать собранные данные страховой компании, строить прогнозы и страховые риски",
				type: 4
			}
		)
	});






